In [69]:
import pandas as pd

In [70]:
player = {
    "name": ['Mo', 'Mane', 'Boby'],
    "number": ['11', '10', '9'],
    "position": ['RW', 'CF', 'LW']
}

In [71]:
df = pd.DataFrame(player)

In [72]:
df

   name number position
0    Mo     11       RW
1  Mane     10       CF
2  Boby      9       LW

### To set a custom index

In [73]:
df.set_index('number')

        name position
number
11        Mo       RW
10      Mane       CF
9       Boby       LW

In [74]:
df

   name number position
0    Mo     11       RW
1  Mane     10       CF
2  Boby      9       LW

In [75]:
df.set_index('number', inplace=True)

In [76]:
df

        name position
number
11        Mo       RW
10      Mane       CF
9       Boby       LW

### TO remove the Custom index

In [77]:
df.index

Index(['11', '10', '9'], dtype='object', name='number')

In [78]:
df.loc['10']

name        Mane
position      CF
Name: 10, dtype: object

In [79]:
df.loc['9', 'position']

'LW'

In [80]:
df.reset_index(inplace=True)

In [81]:
df.index

RangeIndex(start=0, stop=3, step=1)